IDEA Open Model
ValueTypec0 Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Define type of c0 value
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum ValueTypec0
Public Enumeration ValueTypec0
Members
Member name | Value | Description
UserDefined | 0 |  Value is inputed by user
ConstantDistributionMoment | 1 |  Value depends on constant distribution of moment
ParabolicDistributionMoment | 2 |  Value depends on parabolic distribution of moment
TriangularDistributionMoment | 3 |  Value depends on triangular distribution of moment
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace